; ModuleID = 'main.7rcbfp3g-cgu.0'
source_filename = "main.7rcbfp3g-cgu.0"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.7.0"

%"std::fmt::Formatter" = type { [0 x i64], { i64, i64 }, [0 x i64], { i64, i64 }, [0 x i64], { {}*, [3 x i64]* }, [0 x i32], i32, [0 x i32], i32, [0 x i8], i8, [7 x i8] }
%"core::fmt::Opaque" = type {}
%"std::fmt::Arguments" = type { [0 x i64], { [0 x { [0 x i8]*, i64 }]*, i64 }, [0 x i64], { i64*, i64 }, [0 x i64], { [0 x { i8*, i64* }]*, i64 }, [0 x i64] }
%"unwind::libunwind::_Unwind_Exception" = type { [0 x i64], i64, [0 x i64], void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [0 x i64], [6 x i64], [0 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }

@vtable.0 = private unnamed_addr constant { void (i64**)*, i64, i64, i32 (i64**)*, i32 (i64**)*, i32 (i64**)* } { void (i64**)* @_ZN4core3ptr13drop_in_place17h08086275706499c8E, i64 8, i64 8, i32 (i64**)* @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h86cae5132c3d1707E", i32 (i64**)* @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h86cae5132c3d1707E", i32 (i64**)* @"_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h9c2a928dfb99cf6bE" }, align 8, !dbg !0
@alloc1 = private unnamed_addr constant <{ [14 x i8] }> <{ [14 x i8] c"Hello, world! " }>, align 1
@alloc3 = private unnamed_addr constant <{ [1 x i8] }> <{ [1 x i8] c"\0A" }>, align 1

!45 = !DILocalVariable(name: "f", arg: 1, scope: !38, file: !39, line: 121, type: !11)
!46 = !DILocalVariable(name: "result", scope: !47, file: !39, line: 125, type: !48, align: 1)
!47 = distinct !DILexicalBlock(scope: !38, file: !39, line: 125, column: 5)
!48 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!49 = !{!50, !51}
!50 = !DITemplateTypeParameter(name: "F", type: !11)
!51 = !DITemplateTypeParameter(name: "T", type: !48)
!52 = !DILocation(line: 125, column: 9, scope: !47)
!53 = !DILocation(line: 121, column: 43, scope: !38)
!54 = !DILocation(line: 125, column: 18, scope: !38)
!55 = !DILocation(line: 128, column: 5, scope: !47)
!56 = !DILocation(line: 131, column: 2, scope: !38)
!57 = !DILocation(line: 131, column: 1, scope: !38)
!58 = !DILocation(line: 121, column: 1, scope: !38)
!59 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h41dc5fab2cc34e6eE", scope: !7, file: !60, line: 60, type: !61, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !70, retainedNodes: !66)
!60 = !DIFile(filename: "/Users/tiberio/.rustup/toolchains/nightly-x86_64-apple-darwin/lib/rustlib/src/rust/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "a29dbe91f6c44a4e9c1b3c06440e8785")
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !11, !63, !64}
!63 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !{!67, !68, !69}
!67 = !DILocalVariable(name: "main", arg: 1, scope: !59, file: !60, line: 61, type: !11)
!68 = !DILocalVariable(name: "argc", arg: 2, scope: !59, file: !60, line: 62, type: !63)
!69 = !DILocalVariable(name: "argv", arg: 3, scope: !59, file: !60, line: 63, type: !64)
!70 = !{!51}
!71 = !DILocation(line: 61, column: 5, scope: !59)
!72 = !DILocation(line: 62, column: 5, scope: !59)
!73 = !DILocation(line: 63, column: 5, scope: !59)
!74 = !DILocation(line: 66, column: 10, scope: !59)
!75 = !DILocation(line: 66, column: 9, scope: !59)
!76 = !DILocation(line: 65, column: 5, scope: !59)
!77 = !DILocation(line: 70, column: 2, scope: !59)
!78 = distinct !DISubprogram(name: "{{closure}}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h86cae5132c3d1707E", scope: !6, file: !60, line: 66, type: !79, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !70, retainedNodes: !83)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !82}
!81 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&closure-0", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!83 = !{!84}
!84 = !DILocalVariable(name: "main", scope: !78, file: !60, line: 61, type: !11, align: 8)
!85 = !DILocation(line: 61, column: 5, scope: !78)
!86 = !DILocation(line: 66, column: 77, scope: !78)
!87 = !DILocation(line: 66, column: 18, scope: !78)
!88 = !DILocation(line: 66, column: 91, scope: !78)
!89 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h6a2ea0f5235c9cdaE", scope: !91, file: !90, line: 429, type: !98, scopeLine: 429, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !4, retainedNodes: !101)
!90 = !DIFile(filename: "/Users/tiberio/.rustup/toolchains/nightly-x86_64-apple-darwin/lib/rustlib/src/rust/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "0e90531be854973cc338b563f3ec214e")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !92, file: !2, size: 8, align: 8, elements: !96, templateParams: !4, identifier: "763c3540bbc200a676e26f1286dd9f23")
!92 = !DINamespace(name: "process_common", scope: !93)
!93 = !DINamespace(name: "process", scope: !94)
!94 = !DINamespace(name: "unix", scope: !95)
!95 = !DINamespace(name: "sys", scope: !8)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !91, file: !2, baseType: !24, size: 8, align: 8)
!98 = !DISubroutineType(types: !99)
!99 = !{!81, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !{!102}
!102 = !DILocalVariable(name: "self", arg: 1, scope: !89, file: !90, line: 429, type: !100)
!103 = !DILocation(line: 429, column: 19, scope: !89)
!104 = !DILocation(line: 430, column: 9, scope: !89)
!105 = !DILocation(line: 431, column: 6, scope: !89)
!106 = distinct !DISubprogram(name: "new<f32>", linkageName: "_ZN4core3fmt10ArgumentV13new17hd3a0c717a5eb2f86E", scope: !108, file: !107, line: 267, type: !153, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !163, retainedNodes: !160)
!107 = !DIFile(filename: "/Users/tiberio/.rustup/toolchains/nightly-x86_64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8383a2f1b977481a5e40ad3226309813")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !31, file: !2, size: 128, align: 64, elements: !109, templateParams: !4, identifier: "d2c90fa46196226b67729fe9298157d")
!109 = !{!110, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !108, file: !2, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::::Opaque", baseType: !112, size: 64, align: 64, dwarfAddressSpace: 0)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", file: !2, align: 8, elements: !4, identifier: "e9a59f198265abbc360b0ea240f956fa")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !108, file: !2, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !115, size: 64, align: 64, dwarfAddressSpace: 0)
!115 = !DISubroutineType(types: !116)
!116 = !{!21, !111, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !31, file: !2, size: 512, align: 64, elements: !119, templateParams: !4, identifier: "1f573d63f2ab1ce613b58742b128b808")
!119 = !{!120, !122, !124, !125, !142, !143}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !2, baseType: !121, size: 32, align: 32, offset: 384)
!121 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !118, file: !2, baseType: !123, size: 32, align: 32, offset: 416)
!123 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !118, file: !2, baseType: !28, size: 8, align: 8, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !118, file: !2, baseType: !126, size: 128, align: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !127, file: !2, size: 128, align: 64, elements: !128, identifier: "1e8fc19a501ea863e72c3f1e15e073dc")
!127 = !DINamespace(name: "option", scope: !23)
!128 = !{!129}
!129 = !DICompositeType(tag: DW_TAG_variant_part, scope: !127, file: !2, size: 128, align: 64, elements: !130, templateParams: !133, identifier: "1e8fc19a501ea863e72c3f1e15e073dc_variant_part", discriminator: !140)
!130 = !{!131, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !129, file: !2, baseType: !132, size: 128, align: 64, extraData: i64 0)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !126, file: !2, size: 128, align: 64, elements: !4, templateParams: !133, identifier: "1e8fc19a501ea863e72c3f1e15e073dc::None")
!133 = !{!134}
!134 = !DITemplateTypeParameter(name: "T", type: !135)
!135 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !129, file: !2, baseType: !137, size: 128, align: 64, extraData: i64 1)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !126, file: !2, size: 128, align: 64, elements: !138, templateParams: !133, identifier: "1e8fc19a501ea863e72c3f1e15e073dc::Some")
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !137, file: !2, baseType: !135, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !127, file: !2, baseType: !141, size: 64, align: 64, flags: DIFlagArtificial)
!141 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !118, file: !2, baseType: !126, size: 128, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !118, file: !2, baseType: !144, size: 128, align: 64, offset: 256)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut Write", scope: !31, file: !2, size: 128, align: 64, elements: !145, templateParams: !4, identifier: "1aafa9c98565f0c76762b1c7dea049cd")
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !144, file: !2, baseType: !147, size: 64, align: 64, flags: DIFlagArtificial)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !144, file: !2, baseType: !149, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 192, align: 64, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 3, lowerBound: 0)
!153 = !DISubroutineType(types: !154)
!154 = !{!108, !155, !157}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&f32", baseType: !156, size: 64, align: 64, dwarfAddressSpace: 0)
!156 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&f32, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !158, size: 64, align: 64, dwarfAddressSpace: 0)
!158 = !DISubroutineType(types: !159)
!159 = !{!21, !155, !117}
!160 = !{!161, !162}
!161 = !DILocalVariable(name: "x", arg: 1, scope: !106, file: !107, line: 267, type: !155)
!162 = !DILocalVariable(name: "f", arg: 2, scope: !106, file: !107, line: 267, type: !157)
!163 = !{!164}
!164 = !DITemplateTypeParameter(name: "T", type: !156)
!165 = !DILocation(line: 267, column: 23, scope: !106)
!166 = !DILocation(line: 267, column: 33, scope: !106)
!167 = !DILocation(line: 276, column: 42, scope: !106)
!168 = !DILocation(line: 276, column: 68, scope: !106)
!169 = !DILocation(line: 276, column: 18, scope: !106)
!170 = !DILocation(line: 277, column: 6, scope: !106)
!171 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h20fccb459b893337E", scope: !172, file: !107, line: 313, type: !234, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !4, retainedNodes: !236)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !31, file: !2, size: 384, align: 64, elements: !173, templateParams: !4, identifier: "76b7a9bb3aed71d786837bddfb0753ec")
!173 = !{!174, !184, !228}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !172, file: !2, baseType: !175, size: 128, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !176, templateParams: !4, identifier: "e5181a2ba73cefd2b9372dc5646453a9")
!176 = !{!177, !183}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !175, file: !2, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !180, templateParams: !4, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !179, file: !2, baseType: !65, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !179, file: !2, baseType: !135, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !175, file: !2, baseType: !135, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !172, file: !2, baseType: !185, size: 128, align: 64, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !127, file: !2, size: 128, align: 64, elements: !186, identifier: "aaae938ffef63c21303efdefe6cb2dbb")
!186 = !{!187}
!187 = !DICompositeType(tag: DW_TAG_variant_part, scope: !127, file: !2, size: 128, align: 64, elements: !188, templateParams: !191, identifier: "aaae938ffef63c21303efdefe6cb2dbb_variant_part", discriminator: !140)
!188 = !{!189, !224}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !187, file: !2, baseType: !190, size: 128, align: 64, extraData: i64 0)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !185, file: !2, size: 128, align: 64, elements: !4, templateParams: !191, identifier: "aaae938ffef63c21303efdefe6cb2dbb::None")
!191 = !{!192}
!192 = !DITemplateTypeParameter(name: "T", type: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !194, templateParams: !4, identifier: "74d515130a6fe79f849222b698698b47")
!194 = !{!195, !223}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !193, file: !2, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::rt::v1::Argument", baseType: !197, size: 64, align: 64, dwarfAddressSpace: 0)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !29, file: !2, size: 448, align: 64, elements: !198, templateParams: !4, identifier: "f08f75da3c994a39573138ccfbe8ac60")
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !197, file: !2, baseType: !135, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !197, file: !2, baseType: !201, size: 384, align: 64, offset: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !29, file: !2, size: 384, align: 64, elements: !202, templateParams: !4, identifier: "b378376481d6c5daa3b3c0ea89d23753")
!202 = !{!203, !204, !205, !206, !222}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !201, file: !2, baseType: !123, size: 32, align: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !201, file: !2, baseType: !28, size: 8, align: 8, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !201, file: !2, baseType: !121, size: 32, align: 32, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !201, file: !2, baseType: !207, size: 128, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !29, file: !2, size: 128, align: 64, elements: !208, identifier: "5aebf68034f1dabb67782dd4f8e7d101")
!208 = !{!209}
!209 = !DICompositeType(tag: DW_TAG_variant_part, scope: !29, file: !2, size: 128, align: 64, elements: !210, templateParams: !4, identifier: "5aebf68034f1dabb67782dd4f8e7d101_variant_part", discriminator: !221)
!210 = !{!211, !215, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !209, file: !2, baseType: !212, size: 128, align: 64, extraData: i64 0)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !207, file: !2, size: 128, align: 64, elements: !213, templateParams: !4, identifier: "5aebf68034f1dabb67782dd4f8e7d101::Is")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !212, file: !2, baseType: !135, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !209, file: !2, baseType: !216, size: 128, align: 64, extraData: i64 1)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !207, file: !2, size: 128, align: 64, elements: !217, templateParams: !4, identifier: "5aebf68034f1dabb67782dd4f8e7d101::Param")
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !216, file: !2, baseType: !135, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !209, file: !2, baseType: !220, size: 128, align: 64, extraData: i64 2)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !207, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "5aebf68034f1dabb67782dd4f8e7d101::Implied")
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !29, file: !2, baseType: !141, size: 64, align: 64, flags: DIFlagArtificial)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !201, file: !2, baseType: !207, size: 128, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !193, file: !2, baseType: !135, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !187, file: !2, baseType: !225, size: 128, align: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !185, file: !2, size: 128, align: 64, elements: !226, templateParams: !191, identifier: "aaae938ffef63c21303efdefe6cb2dbb::Some")
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !225, file: !2, baseType: !193, size: 128, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !172, file: !2, baseType: !229, size: 128, align: 64, offset: 256)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !230, templateParams: !4, identifier: "66438e16d71ef5a1e10493d50a03212")
!230 = !{!231, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !229, file: !2, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::ArgumentV1", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !229, file: !2, baseType: !135, size: 64, align: 64, offset: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!172, !175, !229}
!236 = !{!237, !238}
!237 = !DILocalVariable(name: "pieces", arg: 1, scope: !171, file: !107, line: 313, type: !175)
!238 = !DILocalVariable(name: "args", arg: 2, scope: !171, file: !107, line: 313, type: !229)
!239 = !DILocation(line: 313, column: 19, scope: !171)
!240 = !DILocation(line: 313, column: 47, scope: !171)
!241 = !DILocation(line: 314, column: 34, scope: !171)
!242 = !DILocation(line: 314, column: 9, scope: !171)
!243 = !DILocation(line: 315, column: 6, scope: !171)
!244 = distinct !DISubprogram(name: "call_once<closure-0,()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h9c2a928dfb99cf6bE", scope: !246, file: !245, line: 227, type: !249, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !255, retainedNodes: !252)
!245 = !DIFile(filename: "/Users/tiberio/.rustup/toolchains/nightly-x86_64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "e7b2206724943b8a8140f7c1065997a3")
!246 = !DINamespace(name: "FnOnce", scope: !247)
!247 = !DINamespace(name: "function", scope: !248)
!248 = !DINamespace(name: "ops", scope: !23)
!249 = !DISubroutineType(types: !250)
!250 = !{!81, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut closure-0", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!252 = !{!253, !254}
!253 = !DILocalVariable(arg: 1, scope: !244, file: !245, line: 227, type: !251)
!254 = !DILocalVariable(arg: 2, scope: !244, file: !245, line: 227, type: !48)
!255 = !{!256, !257}
!256 = !DITemplateTypeParameter(name: "Self", type: !5)
!257 = !DITemplateTypeParameter(name: "Args", type: !48)
!258 = !DILocation(line: 227, column: 5, scope: !244)
!259 = distinct !DISubprogram(name: "call_once<fn(),()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h03752571149a459dE", scope: !246, file: !245, line: 227, type: !42, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !263, retainedNodes: !260)
!260 = !{!261, !262}
!261 = !DILocalVariable(arg: 1, scope: !259, file: !245, line: 227, type: !11)
!262 = !DILocalVariable(arg: 2, scope: !259, file: !245, line: 227, type: !48)
!263 = !{!264, !257}
!264 = !DITemplateTypeParameter(name: "Self", type: !11)
!265 = !DILocation(line: 227, column: 5, scope: !259)
!266 = distinct !DISubprogram(name: "call_once<closure-0,()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he03076b2f3e69f12E", scope: !246, file: !245, line: 227, type: !267, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !255, retainedNodes: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{!81, !5}
!269 = !{!270, !271}
!270 = !DILocalVariable(arg: 1, scope: !266, file: !245, line: 227, type: !5)
!271 = !DILocalVariable(arg: 2, scope: !266, file: !245, line: 227, type: !48)
!272 = !DILocation(line: 227, column: 5, scope: !266)
!273 = distinct !DISubprogram(name: "drop_in_place<closure-0>", linkageName: "_ZN4core3ptr13drop_in_place17h08086275706499c8E", scope: !275, file: !274, line: 179, type: !276, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !280, retainedNodes: !278)
!274 = !DIFile(filename: "/Users/tiberio/.rustup/toolchains/nightly-x86_64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "5bd0a17517ec02b2d4f77a2ea68243bd")
!275 = !DINamespace(name: "ptr", scope: !23)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !251}
!278 = !{!279}
!279 = !DILocalVariable(arg: 1, scope: !273, file: !274, line: 179, type: !251)
!280 = !{!281}
